Revit 2024 API
StructuralSectionGeneralT Class
 Defines parameters for Tees shape.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class StructuralSectionGeneralT : StructuralSectionHotRolled
Visual Basic
Public Class StructuralSectionGeneralT _
	Inherits StructuralSectionHotRolled
Visual C++
public ref class StructuralSectionGeneralT : public StructuralSectionHotRolled
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitParallelFlange
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitSlopedFlange
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionStructuralTees
See Also
StructuralSectionGeneralT Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace